Revit 2015 API
ExternalResourceTypes.BuiltInExternalResourceTypes Members
Provides a container of all Revit built-in ExternalResourceType instances.
The ExternalResourceTypes.BuiltInExternalResourceTypes type exposes the following members.
Properties
Name | Description
AssemblyCodeTable
 An external resource type representing assembly code data.
KeynoteTable
 An external resource type representing keynote data.
RevitLink
 An external resource type representing Revit Links data.
See Also
ExternalResourceTypes.BuiltInExternalResourceTypes Class
Autodesk.Revit.DB Namespace